desafios/poo/README.md
```mermaid
classDiagram

class Iphone


class  ReprodutorMusical
<<interface>> ReprodutorMusical
ReprodutorMusical : +tocar()
ReprodutorMusical : +pausar()
ReprodutorMusical : +selecionarMusica(String musica)

class AparelhoTelefonico
<<interface>> AparelhoTelefonico
AparelhoTelefonico: +ligar(String numero)
AparelhoTelefonico : +atender()
AparelhoTelefonico : +iniciarCorreioVoz()

class NavegadorNaInternet
<<interface>> NavegadorNaInternet
NavegadorNaInternet : +exibirPagina(String url)
NavegadorNaInternet : +adicionarNovaAba()
NavegadorNaInternet : +atualizarPagina()

Iphone "1" --> "*" NavegadorNaInternet : Implementa
Iphone "1" --> "1" AparelhoTelefonico : Implementa
Iphone "1" --> "*" ReprodutorMusical : Implementa
```
